app/controllers/movies_controller.rb

  def index
    sort_string = " #{params[:column]} #{ params[:sort]}"
    @movies = Movie.order(sort_string)
---
SELECT "movies".* FROM "movies" WHERE "rating"."PG-13" = '1'